# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with CBAM attention
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cbam.yaml' will call yolov8-cbam.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-CBAM summary: ~135 layers, ~3.2M parameters
  s: [0.33, 0.50, 1024] # YOLOv8s-CBAM summary: ~135 layers, ~11.2M parameters
  m: [0.67, 0.75, 768] # YOLOv8m-CBAM summary: ~175 layers, ~26M parameters
  l: [1.00, 1.00, 512] # YOLOv8l-CBAM summary: ~215 layers, ~44M parameters
  x: [1.00, 1.25, 512] # YOLOv8x-CBAM summary: ~215 layers, ~68M parameters

# YOLOv8.0n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [7]] # CBAM after C2f
  - [-1, 1, Conv, [256, 3, 2]] # 7-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [7]] # CBAM after C2f
  - [-1, 1, Conv, [512, 3, 2]] # 10-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [7]] # CBAM after C2f
  - [-1, 1, Conv, [1024, 3, 2]] # 13-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [7]] # CBAM after C2f
  - [-1, 1, SPPF, [1024, 5]] # 16

# YOLOv8.0n head with CBAM
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4 (after CBAM)
  - [-1, 3, C2f, [512]] # 17
  - [-1, 1, CBAM, [7]] # CBAM after C2f

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 (after CBAM)
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)
  - [-1, 1, CBAM, [7]] # CBAM after C2f

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 25 (P4/16-medium)
  - [-1, 1, CBAM, [7]] # CBAM after C2f

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 29 (P5/32-large)
  - [-1, 1, CBAM, [7]] # CBAM after C2f

  - [[20, 24, 28], 1, Detect, [nc]] # Detect(P3, P4, P5)